{
  "main": {
    "name":"Abiola Olatunji .S.",
    "description":"I am software architect that major in Web and Mobile. I use Node.js, Php, Laravel, React, Vue, Angular to develop web apps; Flutter and Java for mobile apps. This interface is a resume template that can be used as my projects home page or resume page",
    "image":"profilepicmine.jpg",
    "bio":"I'm a developer! I'm imperative to you than to myself. Solutions to your challenges is my priority.I beleive in the power of togetherness and I'm always eager to collaborate on any project that proffer solution to challenges facing mankind. Software Architect, Song writer, Singer",
    "contactmessage":"Here is where you should write your message to readers to have them get in contact with you.",
    "email": "abiolaolatunji007@gmail.com",
    "phone": "+2348105921529",
    "github":"https://github.com/Mrbeyond",
    "project":"https://github.com/Mrbeyond/Myportfolio",
    "address":{
      "street":"Peace Estate",
      "city":"Ogbomosho",
      "state":"Oyo State",
      "zip": "210271"
    },
    "website": "http://www.timbakerdev.com",
    "resumedownload":"https://docs.google.com/document/d/1gIQIKISElSZzaRZS-pWSzMbsPTxbu7LNF61xOULG2j4/edit?usp=sharing",
    "social":[
      {
        "name":"facebook",
        "url":"https://github.com/abiola.olatunji.52",
        "className":"fa fa-facebook"
      },
      {
        "name":"twitter",
        "url":"https://twitter.com/beyondoffizial",
        "className":"fa fa-twitter"
      },
      {
        "name":"linkedin",
        "url":"https://www.linkedin.com/in/abiola-beyond-84a78919a/",
        "className":"fa fa-linkedin"
      },
      {
        "name":"instagram",
        "url":"https://www.instagram.com/ama_beyond",
        "className":"fa fa-instagram"
      },
      {
        "name":"github",
        "url":"https://github.com/mrbeyond",
        "className":"fa fa-github"
      }
    ]
  },
  "resume":{
    "skillmessage":"I derive much joy in Javascript and its protentials, it has helped a lot in learning new languages because programming is concept but only syntax may differ in each language. Java and Python are very powerful tech and I like scripting logics with them. Flutter is my recent discovery and currently under exploration for beautiful mobile applications. Php and its framework like Laravel are cool and has lots of resources which makes it very interesting. Ability to learn new tech quickly is another skill I can boost of as well as collaborating with others to achieve a common goal.",
    "education":[
      {
        "school":"The Federal Polytechnic Offa, Kwara State",
        "degree":"Diploma in Eletrical Electronics Engineering",
        "graduated":"March 2016",
        "description":"I was introduced to programming as a course and got to know about its potential. Qbasic was the language being taught in the course and its the main drive that pushed me into Development world. Good mathematics operations learned helps a lot at solving complex logics with easy approach in applications development."
      },
      {
        "school":"Soft Quest Incorporated (SQI) College of ICT, Ogbomosh, Oyo State",
        "degree":"Diploma in Software Architecture",
        "graduated":"March 2021",
        "description":"Learned everything about software development and attained solid skills with frequent tests and practical projects. HTML, CSS, JAVASCRIPT, BOOTSTRAP, PHP, NODE.JS, ANGULAR, REACT, VUE, JAVA, PYTHON, LARAVEL, ANDROID (with java), VERSION CONTROL (Git) and general programming concepts are learned in the institution. Class projects given and done are categorized viz: Javascript [Unit converter, calculator, Loan discount evaluator, Drawing App using canvas, Bar chart generator using canvas], Node.js [Notebook, Chat App with using socket] Vue and React and Angular [ Todo App ], Python [Calculator GUI, ATM App console and GUI, NotePad GUI], Java [Calculator GUI, Notepad GUI]"
      }
    ],
    "work":[
      {
        "company":"Medillery LTD",
        "title":"Lead Developer",
        "years":"October 2019 - Present",
        "description": "Successful freelancing platform designed to link ui/ux designers and clients. 2 years of experience in demanding environments focused on producing cutting-edge systems with React.js and larval in directing development with creative and performance-oriented approach. \n •Ongoing Image templating system started 5 months ago till present using Laravel and React.js as the technologies.\n •Ongoing Project presentation System using reactive and responsive image replicas for app pages linking, started 3 months ago till present using Laravel and Vue.js as the technologies.\n •Managed development milestones from initial steps through final delivery with Laravel for back and and react for frontend.\n •Integration of DevOps like AWS S3 for cloud storage.\n •Code review, debugging, unit to compound testing"
      },
      {
        "company":"Paycoins",
        "title":"Frontend Engineer ",
        "years":"February 2021 - Present",
        "description":"Cryptocurrency payment gateway platform using Node js and Vue js as the development technologies. Managed the frontend architecture, design and logic using vue.js"
      },
      {
        "company":"Bomzak",
        "title":"Frontend Engineer ",
        "years":"January 2021 - March 2021",
        "description":"Admin Dashboard for vehicle taxes and revenue management system for a popular state in Nigeria with over 3 months of successful experience and contributions to completion of the project. Used Vue as the frontend technology for design and logic"
      }
    ],
    "skills":[
      {
        "name":"Javascript",
        "level":"90%"
      },
      {
        "name":"Node",
        "level":"70%"
      },
      {
        "name":"Vue",
        "level":"80%"
      },
      {
        "name":"React",
        "level":"80%"
      },
      {
        "name":"Angular",
        "level":"70%"
      },
      {
        "name":"CSS",
        "level":"80%"
      },
      {
        "name":"PHP",
        "level":"70%"
      },
      {
        "name":"Python",
        "level":"60%"
      },
      {
        "name":"JAVA",
        "level":"60%"
      },
      {
        "name":"Flutter",
        "level":"50%"
      },
      {
        "name":"SQL",
        "level":"80%"
      },      
      {
        "name":"Mongodb",
        "level":"70%"
      }
    ]
  },
  "portfolio":{
    "projects": [
      {
        "title":"Medillery LTD",
        "category":"UI/UX Design Freelancing",
        "image":"medillery.png",
        "url":"https://medillery.com"
      },
      {
        "title":"Paycoins",
        "category":"Cryptocurrency payment gateway",
        "image":"paycoins.png",
        "url":"https://pay-coins.netlify.app"
      },
      {
        "title":"MECP",
        "category":"Vehicle Taxes and Revenue",
        "image":"mecp.png",
        "url":"/#"
      }
      
    ]
  }
}
